Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.RemoveFromObjectType Method
 Removes the user property item from the given object type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveFromObjectType(
	CatalogObjectTypeEnum objectType
)
Public Function RemoveFromObjectType (
	objectType As CatalogObjectTypeEnum
) As Boolean
Parameters
objectType
Type: Tekla.Structures.Catalogs.CatalogObjectTypeEnum
The object type to remove the item from.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace